# Advanced Dataframes

In [1]:
import pandas as pd
import numpy as np
from pydataset import data

1. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [2]:
def get_db_url(user, host, password, db_name):
    """
    Order is important!! make sure you enter user, host, password, and then the name of the database you want to access
    """
    url = f'mysql+pymysql://{user}:{password}@{host}/{db_name}'
    return url

2. Use your function to obtain a connection to the employees database.

In [3]:
from env import host, user, password
db_name = 'employees'
url = get_db_url(user, host, password, db_name)

In [4]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

3. Once you have successfully run a query:

- a. Intentionally make a typo in the database url. What kind of error message do you see?

    - OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'florence12'@'%' to database 'employes'")
(Background on this error at: http://sqlalche.me/e/13/e3q8)

- b. Intentionally make an error in your SQL query. What does the error message look like?
    - ProgrammingError: (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '5 OFFSET 50' at line 1")

4. Read the employees and titles tables into two separate DataFrames.

In [6]:
employees_df = pd.read_sql(
'''
SELECT * FROM employees
''',
url)

In [8]:
titles_df = pd.read_sql(
'''
SELECT * FROM titles
''',
url)

5. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [11]:
# 300024 rows x 6 columns in employees
employees_df.shape

(300024, 6)

In [12]:
#443308 rows x 4 columns in titles
titles_df.shape

(443308, 4)

6. Display the summary statistics for each DataFrame.

In [44]:
employees_df.describe(exclude = np.number)

        birth_date first_name last_name  gender   hire_date
count       300024     300024    300024  300024      300024
unique        4750       1275      1637       2        5434
top     1952-03-08     Shahab      Baba       M  1985-06-20
freq            95        295       226  179973         132

In [45]:
titles_df.describe(exclude = np.number)

           title   from_date     to_date
count     443308      443308      443308
unique         7        6393        5888
top     Engineer  1998-10-25  9999-01-01
freq      115003         132      240124

7. How many unique titles are in the titles DataFrame?

In [27]:
#find unique values in the titles column
titles_df.title.unique()

#find type of this output - its a numpy array
type(titles_df.title.unique())

#use shape to figure out how many values are in there
titles_df.title.unique().shape

(7,)

8. What is the oldest date in the to_date column?

In [46]:
# little tester to see what the df looks like 
titles_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [47]:
titles_df.to_date.sort_values().head(1) #inital way, sort the values and get the top one

16064    1985-03-01
Name: to_date, dtype: object

In [48]:
titles_df.to_date.min() #wizard way

datetime.date(1985, 3, 1)

In [49]:
min(titles_df['to_date']) #another wizard way

datetime.date(1985, 3, 1)

In [50]:
type(min(titles_df['to_date']))

datetime.date

9. What is the most recent date in the to_date column?

In [37]:
titles_df.to_date.max()

datetime.date(9999, 1, 1)

# Exercises II
1. Copy the users and roles DataFrames from the examples above.

2. What is the result of using a right join on the DataFrames?

3. What is the result of using an outer join on the DataFrames?

4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

5. Load the mpg dataset from PyDataset.

6. Output and read the documentation for the mpg dataset.

7. How many rows and columns are in the dataset?

8. Check out your column names and perform any cleanup you may want on them.

9. Display the summary statistics for the dataset.

10. How many different manufacturers are there?

11. How many different models are there?

12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

16. Do automatic or manual cars have better miles per gallon?

1. Copy the users and roles DataFrames from the examples above.

2. What is the result of using a right join on the DataFrames?

3. What is the result of using an outer join on the DataFrames?

4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

5. Load the mpg dataset from PyDataset.

6. Output and read the documentation for the mpg dataset.